# словник, який повинні використовувати члени команди
student = {
    "Максимов Денис Віталійович": {
        "Група": "КН-33", 
        "Курс": 2, 
        "Оцінки": {
            "Алгоритми і структури даних": 99,
            "Математичні методи дослідження операцій": 94,
            "Чисельні методи": 64,
            "Організація ІТ-бізнесу": 73,
            "Програмування мовою Python": 94,
        }
    },
    "Євтушенко Дар'я Юріївна": {
        "Група": "КН-33", 
        "Курс": 2, 
        "Оцінки": {
            "Алгоритми і структури даних": 82,
            "Математичні методи дослідження операцій": 72,
            "Чисельні методи": 70,
            "Організація ІТ-бізнесу": 95,
            "Програмування мовою Python": 65,
        }
    },
    "Іванов Володимир Романович": {
        "Група": "КН-33", 
        "Курс": 2, 
        "Оцінки": {
            "Алгоритми і структури даних": 89,
            "Математичні методи дослідження операцій": 98,
            "Чисельні методи": 87,
            "Організація ІТ-бізнесу": 77,
            "Програмування мовою Python": 96,
        }
    },
    "Пономаренко Микола Олегович": {
        "Група": "КН-33", 
        "Курс": 2, 
        "Оцінки": {
            "Алгоритми і структури даних": 78,
            "Математичні методи дослідження операцій": 94,
            "Чисельні методи": 65,
            "Організація ІТ-бізнесу": 85,
            "Програмування мовою Python": 88,
        }
    },
    "Приходько Богдан Сергійович": {
        "Група": "КН-33", 
        "Курс": 2, 
        "Оцінки": {
            "Алгоритми і структури даних": 62,
            "Математичні методи дослідження операцій": 79,
            "Чисельні методи": 90,
            "Організація ІТ-бізнесу": 65,
            "Програмування мовою Python": 76,
        }
    }
}
