from Lab8_dict import student

# функція виводу всього словника
def Print(student):
    for i in student:
        print("----------------------------------------------------------")
        print(f"{i}: група - {student[i]['Група']}, курс - {student[i]['Курс']}, оцінки:")
        print(f"  Алгоритми і структури даних: {student[i]['Оцінки']['Алгоритми і структури даних']}")
        print(f"  Математичні методи дослідження операцій: {student[i]['Оцінки']['Математичні методи дослідження операцій']}")
        print(f"  Чисельні методи: {student[i]['Оцінки']['Чисельні методи']}")
        print(f"  Організація ІТ-бізнесу: {student[i]['Оцінки']['Організація ІТ-бізнесу']}")
        print(f"  Програмування мовою Python: {student[i]['Оцінки']['Програмування мовою Python']}")
    print("----------------------------------------------------------")

# функція додання до словника нового студента
def AddStudent(student, name, group, course, r1, r2, r3, r4, r5):
    student[name] = {
        "Група": group,
        "Курс": course,
        "Оцінки": {
            "Алгоритми і структури даних": r1,
            "Математичні методи дослідження операцій": r2,
            "Чисельні методи": r3,
            "Організація ІТ-бізнесу": r4,
            "Програмування мовою Python": r5,
        }
    }
    print(f"Студента {name} додано успішно.")

# функція для видалення студента
def RemoveStudent(student, name):
    if name in student:
        del student[name]
        print(f"Студента {name} видалено успішно.")
    else:
        print(f"Студента з ім'ям {name} не знайдено.")

# виклик функцій виведення словника
Print(student)

# виклик функції для додання нового студента
print("--=== Запис нового студента до словника ===--")
name = str(input("Вкажіть ім'я студента: "))
group = str(input("Вкажіть групу студента: "))
course = int(input("Вкажіть курс студента: "))
print("Вкажіть оцінки студента за окремі предмети: ")
r1 = int(input("Алгоритми і структури даних: "))
r2 = int(input("Математичні методи дослідження операцій: "))
r3 = int(input("Чисельні методи: "))
r4 = int(input("Організація ІТ-бізнесу: "))
r5 = int(input("Програмування мовою Python: "))
AddStudent(student, name, group, course, r1, r2, r3, r4, r5)
print("--============                 ============--")

# виклик функції для видалення студента
print("--===  Видалення студента зі словника   ===--")
name = str(input("Вкажіть ім'я студента: "))
RemoveStudent(student, name)
print("--============                 ============--")
